<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="description" content="">
    <link rel="stylesheet" href="css/base.css">
    <link rel="stylesheet" href="css/anons.css">
    <link rel="shortcut icon" href="ico/Bleach.ico" type="image/x-icon">
    <title>Анонс</title>
</head>
<body>
    <? require_once 'includes/header.php' ; ?>
    <main>
        <section class="container">
            <p>
            История о парне, который пытается спасти мир от зла, заинтересовала многих поклонников жанра.
            Неудивительно, что премьера первой главы, состоявшейся в 2022 году, получила отличные отзывы критиков.
            От внимания зрителей не укрылась тщательная подготовка авторов к своей работе, включая качественный дизайн
            главных героев, за что стоит поблагодарить компанию "Pierrot".
            </p>
            <img src="img/Шинигами/ткв1.jpg" alt="Первая картинка">
            <p>
                После событий оригинального аниме Ичиго Куросаки продолжает свои обязанности Временного шинигами вместе
                со своими друзьями, включая Урью Исиду.
                Вскоре Ичиго встречает члена Ванденрейха, империи, состоящей из последних выживших Квинси.
                Они объявляют войну Шинигами и вторгаются в Уэко Мундо, а затем нацеливаются на Общество Душ.
                Ичиго пытается помешать Квинси уничтожить Общество Душ, в то время как Урью копается в прошлом и
                обнаруживает резню Квинси, устроенную жестокими Шинигами более тысячи лет назад.
            </p>
            <img src="img/Шинигами/ткв2.jpg" alt="Вторая картинка">
            <p>Во время вторжения многие капитаны Общества Душ получают ранения, а главнокомандующий Генрюсай Шигекуни
                Ямамото убит в битве с Яхве.
                Общество Душ пытается восстановиться, и Ичиго с Ренджи Абараи присоединяются к тренировкам Нулевого
                отряда, чтобы достичь высшей силы.
                Ренджи становится сильнее благодаря неортодоксальным методам обучения Нулевого отряда, но Ичиго не может
                завершить своё обучение из-за непонимания истинной природы своих способностей.
                Он возвращается домой, где его отец Иссин, бывший Шинигами, признаётся ему в том, что его мать Масаки
                была чистокровной Квинси.
                Это делает Ичиго наполовину Шинигами, наполовину Квинси.
                Разобравшись с секретами своей семьи, Ичиго завершает обучение в Нулевом отряде.
            </p>
            <img src="img/Шинигами/ткв3.jpg" alt="Третья картинка">
        </section>
        <section class="series">
            <h1>Выход серий</h1>
            <section class="spisok">
                <ol>
                    <li>Серия 1 - 5 октября 2024</li>
                    <li>Серия 2 - 12 октября 2024</li>
                    <li>Серия 3 - 19 октября 2024 </li>
                    <li>Серия 4 - 26 октября 2024</li>
                    <li>Серия 5 - 2 ноября 2024</li>
                    <li>Серия 6 - 9 ноября 2024</li>
                    <li>Серия 7 - 16 ноября 2024</li>
                    <li>Серия 8 - 23 ноября 2024</li>
                    <li>Серия 9 - 30 ноября 2024</li>
                    <li>Серия 10 - 7 декабря 2024</li>
                    <li>Серия 11 - 14 декабря 2024</li>
                    <li>Серия 12 - 21 декабря 2024</li>
                    <li>Серия 13 - 28 декабря 2024</li>
                </ol>
            </section>
        </section>
        <section class="videos">
            <div class="item">
                <h2>Официальный трейлер</h2>
                <video src="video/Трейлер.mp4" controls></video>
            </div>
            <div class="item">
                <h2>Фанатский трейлер</h2>
                <video src="video/фантрейлер.mp4" controls></video>
            </div>
            <div class="item">
                <h2>Видео в честь 20-летия экранизации аниме</h2>
                <video src="video/Блич20лет.mp4" controls></video>
            </div>
        </section>
    </main>
    <? require_once 'includes/footer.php' ; ?>
</body>
</html>