import { useState } from "react";
import { Helmet } from "react-helmet-async";
import styles from "./FaqPage.module.css";
import { BackTo } from "../../components/ui/BackTo/backTo";

export function FaqPage() {
  const [openIndex, setOpenIndex] = useState(null);
  // вопросы и ответы
  const faqData = [
    {
      id: 1,
      question: "Что такое «Блич»?",
      answer:
        "«Блич» — это культовое аниме и манга, рассказывающие о приключениях Ичиго Куросаки — подростка, получившего силы шинигами. Вместе с друзьями он защищает мир живых от злых духов и раскрывает тайны Общества душ.",
    },
    {
      id: 2,
      question: "В каком порядке смотреть аниме «Блич»?",
      answer:
        "Рекомендуется смотреть в хронологическом порядке: сначала оригинальный сериал (2004–2012), затем фильмы, а после — арку «Тысячелетняя кровавая война» (2022). Филлеры можно пропустить, так как они не мешают пониманию сюжета. Но лично мне понравились филлеры «Восстание Зампакто»",
    },
    {
      id: 3,
      question: "Сколько серий в аниме «Блич»?",
      answer:
        "В оригинальном сериале 366 серий, плюс 4 полнометражных фильма и 2 OVA. Арка «Тысячелетняя кровавая война» состоит из 4 частей (куров), последняя выходит в 2026 году.",
    },
    {
      id: 4,
      question: "Чем является этот проект?",
      answer:
        "Этот проект не является клоном аниме вики и подобными. Это по большей мере контентный проект по мотивам одноимённого аниме. Некоторые данные взяты из вики. Проект находится всё ещё в разработке и не стоит воспринимать контент как официальный, так как в некоторых моментах могут быть допущены ошибки, спасибо за понимание!",
    },
    {
      id: 5,
      question: "Кто такой Ичиго Куросаки?",
      answer:
        "Ичиго — главный герой «Блич». Он является временным шинигами, а также наполовину квинси и пустым. Его главная цель — защищать друзей и близких от любой угрозы.",
    },
    {
      id: 6,
      question: "Являются ли эдиты персонажей авторскими?",
      answer: "Нет. Эдиты для персонажей не являются авторскими",
    },
    {
      id: 7,
      question: "Какой технологический стек используется в проекте?",
      answer:
        "На данный момент используется следующий технологический стек: React js, CSS Modules и сборщик проектов Vite. В будующем возможен переход на Next Js и Emotion CSS-in-JS/Tailwind CSS",
    },
    {
      id: 8,
      question:
        "Будет ли продолжение экранизации «Блич» после Тысячелетней кровавой войны?",
      answer:
        "На данный момент официальных анонсов о продолжении аниме после арки «Тысячелетняя кровавая война» нет. Однако сущесвует в манге ещё арка «Ад» и разные новеллы, но об их анонсах нет информации.",
    },
    {
      id: 9,
      question: "Безопасен ли процесс пожертвования?",
      answer:
        "Да, так как сслылка для донатов только одна и весь платёжный процесс происходит непосредственно на Donation Alerts",
    },
    {
      id: 10,
      question: "Что случилось тысячу лет назад до начала событый аниме?",
      answer:
        "Из-за Квинси баланс душ постепенно нарушался и жестокие Шинигами, а именно «Первый состав Готея 13» устроили геноцид почти всех Квинси. А король Квинси - Яхве лёг на дно востанавливать силы, спрятавшись на тысячу лет в тени Сейрейтея, собираясь отомстить. ",
    },
    {
      id: 11,
      question: "Что такое «Особый Боевой Потенциал в ТКВ»?",
      answer: "«Особый Боевой Потенциал» - это список из пяти ключевых лиц, составленный лидером квинси Яхве. В этот список входят: Ичиго Куросаки - за его нераскрытый потенциал и постоянное развитие; Кенпачи Зараки - за его невероятную физическую мощь; Ичибей Хьёсубе - за его мудрость и концептуальную силу лидера Нулевого отряда; Соске Айзен — за его колоссальный уровень духовной силы и гениальный интеллект; Киске Урахара  — за его непредсказуемость, изобретательность и способность находить тактические решения в безвыходных ситуациях."
    }
  ];
  // проверка на открытый аккордион. если хук уже содержит index, то закрывается аккордион
  const toggleAccordion = (index) => {
    setOpenIndex(openIndex === index ? null : index);
  };

  return (
    <>
      <Helmet>
        <title>Bleach | FAQ</title>
        <meta
          name="description"
          content="Ответы на часто задаваемые вопросы о аниме «Блич»: порядок просмотра, персонажи, термины и многое другое."
        />
      </Helmet>
      <div className="wrapper__section">
        <section className="section section__first">
          <div className="container">
            <article className={`article__card ${styles.faq__card}`}>
              <h1 className="article__title">Часто задаваемые вопросы</h1>

              <ul className={styles.faq__list}>
                {faqData.map((item, index) => (
                  <li
                    className={`${styles.faq__item} ${
                      openIndex === index ? styles.faq__item_active : ""
                    }`}
                    key={item.id}
                  >
                    <button
                      className={styles.faq__question}
                      onClick={() => toggleAccordion(index)}
                    >
                      <span className={styles.faq__question_text}>
                        {item.question}
                      </span>
                      <span
                        className={`${styles.faq__icon} ${
                          openIndex === index ? styles.faq__icon_active : ""
                        }`}
                      >
                        +
                      </span>
                    </button>

                    <div
                      className={`${styles.faq__answer_wrapper} ${
                        openIndex === index
                          ? styles.faq__answer_wrapper_open
                          : ""
                      }`}
                    >
                      <p className={styles.faq__answer}>{item.answer}</p>
                    </div>
                  </li>
                ))}
              </ul>
            </article>
          </div>
        </section>
        <BackTo title="Назад" />
      </div>
    </>
  );
}
